yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostlux285a.h
#define FLASH_WAIT_Wait          FLASH_WAIT_bit.Wait

#endif

/*-------------------------------------------------------------------------
 *      Flash Registers bit masks
 *-----------------------------------------------------------------------*/
#define MASK_FLASH_CR1_FIX       0x01
#define MASK_FLASH_CR1_IE        0x02
#define MASK_FLASH_CR1_AHALT     0x04
#define MASK_FLASH_CR1_HALT      0x08

#define MASK_FLASH_CR2_PRG       0x01
#define MASK_FLASH_CR2_FPRG      0x10
#define MASK_FLASH_CR2_ERASE     0x20
#define MASK_FLASH_CR2_WWO       0x40
#define MASK_FLASH_CR2_OPT       0x80

#define MASK_FLASH_NCR2_NPRG     0x01
#define MASK_FLASH_NCR2_NFPRG    0x10
#define MASK_FLASH_NCR2_NERASE   0x20
#define MASK_FLASH_NCR2_NWWO     0x40
#define MASK_FLASH_NCR2_NOPT     0x80

#define MASK_FLASH_IAPSR_WR_PG_DIS 0x01
#define MASK_FLASH_IAPSR_PUL     0x02
#define MASK_FLASH_IAPSR_EOP     0x04
#define MASK_FLASH_IAPSR_DUL     0x08
#define MASK_FLASH_IAPSR_HVOFF   0x40

#define MASK_FLASH_WAIT_Wait     0x03


/*-------------------------------------------------------------------------
 *      Reset Register register definitions
 *-----------------------------------------------------------------------*/
/* Reset status register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char WWDGF       : 1;
  unsigned char IWDGF       : 1;
  unsigned char ILLOPF      : 1;
  unsigned char SWIMF       : 1;
  unsigned char EMCF        : 1;
} __BITS_RST_SR;
#endif
__IO_REG8_BIT(RST_SR,      0x50B3, __READ_WRITE, __BITS_RST_SR);


/*-------------------------------------------------------------------------
 *      Reset Register bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define RST_SR_WWDGF             RST_SR_bit.WWDGF
#define RST_SR_IWDGF             RST_SR_bit.IWDGF
#define RST_SR_ILLOPF            RST_SR_bit.ILLOPF
#define RST_SR_SWIMF             RST_SR_bit.SWIMF
#define RST_SR_EMCF              RST_SR_bit.EMCF

#endif

/*-------------------------------------------------------------------------
 *      Reset Register bit masks
 *-----------------------------------------------------------------------*/
#define MASK_RST_SR_WWDGF        0x01
#define MASK_RST_SR_IWDGF        0x02
#define MASK_RST_SR_ILLOPF       0x04
#define MASK_RST_SR_SWIMF        0x08
#define MASK_RST_SR_EMCF         0x10


/*-------------------------------------------------------------------------
 *      Clock Registers register definitions
 *-----------------------------------------------------------------------*/
/* SMED0 clock configuration register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CK_SW0      : 1;
  unsigned char CK_SW1      : 1;
  unsigned char             : 2;
  unsigned char SMED_0_DIV  : 3;
} __BITS_CLK_SMED0;
#endif
__IO_REG8_BIT(CLK_SMED0,   0x50B4, __READ_WRITE, __BITS_CLK_SMED0);

/* SMED1 clock configuration register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CK_SW0      : 1;
  unsigned char CK_SW1      : 1;
  unsigned char             : 2;
  unsigned char SMED_1_DIV  : 3;
} __BITS_CLK_SMED1;
#endif
__IO_REG8_BIT(CLK_SMED1,   0x50B5, __READ_WRITE, __BITS_CLK_SMED1);

/* SMED2 clock configuration register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CK_SW0      : 1;
  unsigned char CK_SW1      : 1;
  unsigned char             : 2;
  unsigned char SMED_2_DIV  : 3;
} __BITS_CLK_SMED2;
#endif
__IO_REG8_BIT(CLK_SMED2,   0x50B6, __READ_WRITE, __BITS_CLK_SMED2);

/* SMED3 clock configuration register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CK_SW0      : 1;
  unsigned char CK_SW1      : 1;
  unsigned char             : 2;
  unsigned char SMED_3_DIV  : 3;
} __BITS_CLK_SMED3;
#endif
__IO_REG8_BIT(CLK_SMED3,   0x50B7, __READ_WRITE, __BITS_CLK_SMED3);

/* SMED4 clock configuration register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CK_SW0      : 1;
  unsigned char CK_SW1      : 1;
  unsigned char             : 2;
  unsigned char SMED_4_DIV  : 3;
} __BITS_CLK_SMED4;
#endif
__IO_REG8_BIT(CLK_SMED4,   0x50B8, __READ_WRITE, __BITS_CLK_SMED4);

/* SMED5 clock configuration register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CK_SW0      : 1;
  unsigned char CK_SW1      : 1;
  unsigned char             : 2;
  unsigned char SMED_5_DIV  : 3;
} __BITS_CLK_SMED5;
#endif
__IO_REG8_BIT(CLK_SMED5,   0x50B9, __READ_WRITE, __BITS_CLK_SMED5);

/* PLL prescaler configuration register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char PLL_DIV     : 2;
  unsigned char             : 1;
  unsigned char PLL_PRES_DIV: 2;
} __BITS_CLK_PLLDIVR;
#endif
__IO_REG8_BIT(CLK_PLLDIVR, 0x50BE, __READ_WRITE, __BITS_CLK_PLLDIVR);

/* AWU clock prescaler configuration register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char AWUDIV0     : 1;
  unsigned char AWUDIV1     : 1;
  unsigned char AWUDIV2     : 1;
  unsigned char AWUDIV3     : 1;
} __BITS_CLK_AWUDIVR;
#endif
__IO_REG8_BIT(CLK_AWUDIVR, 0x50BF, __READ_WRITE, __BITS_CLK_AWUDIVR);

/* Internal clock control register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char HSIEN       : 1;
  unsigned char HSIRDY      : 1;
  unsigned char FHW         : 1;
  unsigned char LSIEN       : 1;
  unsigned char LSIRDY      : 1;
  unsigned char REGAH       : 1;
} __BITS_CLK_ICKR;
#endif
__IO_REG8_BIT(CLK_ICKR,    0x50C0, __READ_WRITE, __BITS_CLK_ICKR);

/* External clock control register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char HSEEN       : 1;
  unsigned char HSERDY      : 1;
} __BITS_CLK_ECKR;
#endif
__IO_REG8_BIT(CLK_ECKR,    0x50C1, __READ_WRITE, __BITS_CLK_ECKR);

/* External clock control register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char PLLON       : 1;
  unsigned char LOCKP       : 1;
  unsigned char REF_SEL     : 1;
  unsigned char BYPASS      : 1;
  unsigned char SSCG_CTRL   : 1;
  unsigned char SPREAD_CTRL : 1;
  unsigned char PLL_LOCK_INT: 1;
} __BITS_CLK_PLLR;
#endif
__IO_REG8_BIT(CLK_PLLR,    0x50C2, __READ_WRITE, __BITS_CLK_PLLR);

/* Clock master status register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CKM         : 4;
  unsigned char NCKM        : 4;
} __BITS_CLK_CMSR;
#endif
__IO_REG8_BIT(CLK_CMSR,    0x50C3, __READ, __BITS_CLK_CMSR);

/* Clock master switch register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char SWI         : 4;
  unsigned char NSWI        : 4;
} __BITS_CLK_SWR;
#endif
__IO_REG8_BIT(CLK_SWR,     0x50C4, __READ_WRITE, __BITS_CLK_SWR);

/* Clock switch control register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char SWBSY       : 1;
  unsigned char SWEN        : 1;
  unsigned char SWIEN       : 1;
  unsigned char SWIF        : 1;
} __BITS_CLK_SWCR;
#endif
__IO_REG8_BIT(CLK_SWCR,    0x50C5, __READ_WRITE, __BITS_CLK_SWCR);

/* Clock divider register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CPUDIV      : 3;
  unsigned char HSIDIV      : 2;
} __BITS_CLK_DIVR;
#endif
__IO_REG8_BIT(CLK_DIVR,    0x50C6, __READ_WRITE, __BITS_CLK_DIVR);

