yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostlux285a.h
#define MASK_I2C_FREQR_FREQ      0x3F

#define MASK_I2C_OARL_ADD0       0x01
#define MASK_I2C_OARL_ADD1       0x02
#define MASK_I2C_OARL_ADD2       0x04
#define MASK_I2C_OARL_ADD3       0x08
#define MASK_I2C_OARL_ADD4       0x10
#define MASK_I2C_OARL_ADD5       0x20
#define MASK_I2C_OARL_ADD6       0x40
#define MASK_I2C_OARL_ADD7       0x80

#define MASK_I2C_OARH_ADD8       0x02
#define MASK_I2C_OARH_ADD9       0x04
#define MASK_I2C_OARH_ADDCONF    0x40
#define MASK_I2C_OARH_ADDMODE    0x80

#define MASK_I2C_SR1_SB          0x01
#define MASK_I2C_SR1_ADDR        0x02
#define MASK_I2C_SR1_BTF         0x04
#define MASK_I2C_SR1_ADD10       0x08
#define MASK_I2C_SR1_STOPF       0x10
#define MASK_I2C_SR1_RXNE        0x40
#define MASK_I2C_SR1_TXE         0x80

#define MASK_I2C_SR2_BERR        0x01
#define MASK_I2C_SR2_ARLO        0x02
#define MASK_I2C_SR2_AF          0x04
#define MASK_I2C_SR2_OVR         0x08
#define MASK_I2C_SR2_WUFH        0x20

#define MASK_I2C_SR3_MSL         0x01
#define MASK_I2C_SR3_BUSY        0x02
#define MASK_I2C_SR3_TRA         0x04
#define MASK_I2C_SR3_GENCALL     0x10

#define MASK_I2C_ITR_ITERREN     0x01
#define MASK_I2C_ITR_ITEVTEN     0x02
#define MASK_I2C_ITR_ITBUFEN     0x04

#define MASK_I2C_CCRH_CCR        0x0F
#define MASK_I2C_CCRH_DUTY       0x40
#define MASK_I2C_CCRH_F_S        0x80

#define MASK_I2C_TRISER_TRISE    0x3F


/*-------------------------------------------------------------------------
 *      UART register definitions
 *-----------------------------------------------------------------------*/
/* UART status register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char PE          : 1;
  unsigned char FE          : 1;
  unsigned char NF          : 1;
  unsigned char OR          : 1;
  unsigned char IDLE        : 1;
  unsigned char RXNE        : 1;
  unsigned char TC          : 1;
  unsigned char TXE         : 1;
} __BITS_UART_SR;
#endif
__IO_REG8_BIT(UART_SR,     0x5230, __READ_WRITE, __BITS_UART_SR);

/* UART data register */
__IO_REG8    (UART_DR,     0x5231, __READ_WRITE);
/* UART baud rate register 1 */
__IO_REG8    (UART_BRR1,   0x5232, __READ_WRITE);
/* UART baud rate register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char UART_DIV_F  : 4;
  unsigned char UART_DIV_M  : 4;
} __BITS_UART_BRR2;
#endif
__IO_REG8_BIT(UART_BRR2,   0x5233, __READ_WRITE, __BITS_UART_BRR2);

/* UART control register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char PIEN        : 1;
  unsigned char PS          : 1;
  unsigned char PCEN        : 1;
  unsigned char WAKE        : 1;
  unsigned char M           : 1;
  unsigned char UARTD       : 1;
  unsigned char T8          : 1;
  unsigned char R8          : 1;
} __BITS_UART_CR1;
#endif
__IO_REG8_BIT(UART_CR1,    0x5234, __READ_WRITE, __BITS_UART_CR1);

/* UART control register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char SBK         : 1;
  unsigned char RWU         : 1;
  unsigned char REN         : 1;
  unsigned char TEN         : 1;
  unsigned char ILIEN       : 1;
  unsigned char RIEN        : 1;
  unsigned char TCIEN       : 1;
  unsigned char TIEN        : 1;
} __BITS_UART_CR2;
#endif
__IO_REG8_BIT(UART_CR2,    0x5235, __READ_WRITE, __BITS_UART_CR2);

/* UART control register 3 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char             : 4;
  unsigned char STOP        : 2;
} __BITS_UART_CR3;
#endif
__IO_REG8_BIT(UART_CR3,    0x5236, __READ_WRITE, __BITS_UART_CR3);

/* UART control register 4 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char ADD         : 4;
} __BITS_UART_CR4;
#endif
__IO_REG8_BIT(UART_CR4,    0x5237, __READ_WRITE, __BITS_UART_CR4);

/* UART guard time register */
__IO_REG8    (UART_GTR,    0x5239, __READ_WRITE);
/* UART prescaler register */
__IO_REG8    (UART_PSCR,   0x523A, __READ_WRITE);

/*-------------------------------------------------------------------------
 *      UART bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define UART_SR_PE               UART_SR_bit.PE
#define UART_SR_FE               UART_SR_bit.FE
#define UART_SR_NF               UART_SR_bit.NF
#define UART_SR_OR               UART_SR_bit.OR
#define UART_SR_IDLE             UART_SR_bit.IDLE
#define UART_SR_RXNE             UART_SR_bit.RXNE
#define UART_SR_TC               UART_SR_bit.TC
#define UART_SR_TXE              UART_SR_bit.TXE

#define UART_BRR2_UART_DIV_F     UART_BRR2_bit.UART_DIV_F
#define UART_BRR2_UART_DIV_M     UART_BRR2_bit.UART_DIV_M

#define UART_CR1_PIEN            UART_CR1_bit.PIEN
#define UART_CR1_PS              UART_CR1_bit.PS
#define UART_CR1_PCEN            UART_CR1_bit.PCEN
#define UART_CR1_WAKE            UART_CR1_bit.WAKE
#define UART_CR1_M               UART_CR1_bit.M
#define UART_CR1_UARTD           UART_CR1_bit.UARTD
#define UART_CR1_T8              UART_CR1_bit.T8
#define UART_CR1_R8              UART_CR1_bit.R8

#define UART_CR2_SBK             UART_CR2_bit.SBK
#define UART_CR2_RWU             UART_CR2_bit.RWU
#define UART_CR2_REN             UART_CR2_bit.REN
#define UART_CR2_TEN             UART_CR2_bit.TEN
#define UART_CR2_ILIEN           UART_CR2_bit.ILIEN
#define UART_CR2_RIEN            UART_CR2_bit.RIEN
#define UART_CR2_TCIEN           UART_CR2_bit.TCIEN
#define UART_CR2_TIEN            UART_CR2_bit.TIEN

#define UART_CR3_STOP            UART_CR3_bit.STOP

#define UART_CR4_ADD             UART_CR4_bit.ADD

#endif

/*-------------------------------------------------------------------------
 *      UART bit masks
 *-----------------------------------------------------------------------*/
#define MASK_UART_SR_PE          0x01
#define MASK_UART_SR_FE          0x02
#define MASK_UART_SR_NF          0x04
#define MASK_UART_SR_OR          0x08
#define MASK_UART_SR_IDLE        0x10
#define MASK_UART_SR_RXNE        0x20
#define MASK_UART_SR_TC          0x40
#define MASK_UART_SR_TXE         0x80

#define MASK_UART_BRR2_UART_DIV_F 0x0F
#define MASK_UART_BRR2_UART_DIV_M 0xF0

#define MASK_UART_CR1_PIEN       0x01
#define MASK_UART_CR1_PS         0x02
#define MASK_UART_CR1_PCEN       0x04
#define MASK_UART_CR1_WAKE       0x08
#define MASK_UART_CR1_M          0x10
#define MASK_UART_CR1_UARTD      0x20
#define MASK_UART_CR1_T8         0x40
#define MASK_UART_CR1_R8         0x80

#define MASK_UART_CR2_SBK        0x01
#define MASK_UART_CR2_RWU        0x02
#define MASK_UART_CR2_REN        0x04
#define MASK_UART_CR2_TEN        0x08
#define MASK_UART_CR2_ILIEN      0x10
#define MASK_UART_CR2_RIEN       0x20
#define MASK_UART_CR2_TCIEN      0x40
#define MASK_UART_CR2_TIEN       0x80

#define MASK_UART_CR3_STOP       0x30

#define MASK_UART_CR4_ADD        0x0F


/*-------------------------------------------------------------------------
 *      STMR Registers register definitions
 *-----------------------------------------------------------------------*/
/* Control register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CEN         : 1;
  unsigned char UDIS        : 1;
  unsigned char URS         : 1;
  unsigned char OPM         : 1;
  unsigned char             : 3;
  unsigned char ARPE        : 1;
} __BITS_STMR_CR1;
#endif
__IO_REG8_BIT(STMR_CR1,    0x5340, __READ_WRITE, __BITS_STMR_CR1);

/* Interrupt enable register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char UIE         : 1;
} __BITS_STMR_IER;
#endif
__IO_REG8_BIT(STMR_IER,    0x5341, __READ_WRITE, __BITS_STMR_IER);

